001047 SPECIAL-BUYERS SECTION.
001048
001049     MOVE SPACES TO SR-WORK-CENTER-ID.
001050     MOVE ALL-NINES TO RD-GARMENT-NUM.
001051     MOVE ALL-NINES TO SPECIAL-AREA.
001052     MOVE SPACES TO SR-PCB-STATUS.
001053     PERFORM GET-SPECIAL-RECORDS
001054        UNTIL SR-PCB-STATUS NOT = SPACES
001055        OR GD-LAST-GARMENT-INPUT = RD-GARMENT-NUM.
001056     IF RD-GARMENT-NUM = GD-LAST-GARMENT-INPUT
001057        IF MSR-ERROR-COUNT > ZEROS
001058           PERFORM WRITE-OUTP-RECORD-UNPROCESSED
001059        ELSE
001060           COMPUTE OMEGA-TOTAL-COST = OMEGA-GARMENT-COST
001061              + OMEGA-MATL-COST
001062           MOVE OMEGA-TOTAL-COST TO GD-UNIT-STANDARD-LABEL
001063           MOVE OMEGA-MATL-COST TO GD-FABRIC-COST
001064           MOVE OMEGA-GARMENT-COST TO GD-OPER-COST-LABEL
001065           MOVE GREG-DATE-HOLD TO GD-DATE-COSTED-LABEL
001066           MOVE TIME-OF-RUN TO GD-TIME-COSTED-LABEL
001067           MOVE DLR TO GD-METHOD-COSTED-LABEL
001068           PERFORM WRITE-OUTPUT-RECORD
001069     ELSE
001070        PERFORM WRITE-OUTP-RECORD-UNPROCESSED.
001071
001072 SPECIAL-B-EXIT.
001073     EXIT.
